# JAVA_basics
---------------------------------------------------
Lesson_1. Знакомство с языком программирования Java
---------------------------------------------------
Задание: Решить задачу с маршрутами через рекурсию

public class app {

  static int[] solve(int a, int b, int c, int d) {
    int[] arr = new int[b + 1];
    arr[a] = 1;
    for (int index = a + 1; index <= b; index++) {
      if (index % d == 0) {
        arr[index] = arr[index - c] + arr[index / d];
      } else {
        arr[index] = arr[index - c];
      }
    }
    return arr;
  }

  public static void main(String[] args) {
    int a = 6;
    int b = 78;
    int c = 3;
    int d = 5;
    var so = solve(a, b, c, d);

    for (int i = 0; i < so.length; i++) {
      System.out.printf("%d -> %d\n", i, so[i]);
    }
  }
}

-------------------------------------------------
Lesson_2. Почему вы не можете не использовать API
-------------------------------------------------
Задание: Написать программу вычисления n-ого треугольного числа.

----------------------------------
Lesson_3. Коллекции JAVA: Введение
----------------------------------
Задание:
  1) Написать программу, показывающую последовательность действий для игры “Ханойская башня”;
  2) Реализовать алгоритм пирамидальной сортировки (HeapSort).
  
----------------------------------------------------------------
Lesson_4. Хранение и обработка данных ч1: приоритетные коллекции
----------------------------------------------------------------
  Задание:
    1) *+Написать программу, определяющую правильность расстановки скобок в выражении.
        Пример 1: a+(d*3) - истина
        Пример 2: [a+(1*3) - ложь
        Пример 3: [6+(3*3)] - истина
        Пример 4: {a}[+]{(d*3)} - истина
        Пример 5: <{a}+{(d*3)}> - истина
        Пример 6: {a+]}{(d*3)} - ложь
    2) *Реализовать алгоритм сортировки слиянием
    
-----------------------------------------------------------------
Lesson_5. Хранение и обработка данных ч2: множество коллекций Map
-----------------------------------------------------------------
  Задание: Реализовать волновой алгоритм
  
-----------------------------------------------------------------
Lesson_6. Хранение и обработка данных ч3: множество коллекций Set
-----------------------------------------------------------------
  Задание:
    1) Реализовать несколько обходов дерева.
    2) Написать простую реализацию стека. (иметь операции push и pop)
    
